In [29]:
import pandas as pd
import random

# Sample data
names = [
    "Aarav", "Sita", "Rohan", "Nisha", "Karan", "Priya", "Rahul", "Anita", "Vikram", "Neha", "Manish", "Ritu", "Kabir", "Meena", "Arjun", "Pooja", "Yash", "Kavya", "Dev", "Anjali", "Rakesh", "Sunita", "Ishaan", "Deepa", "Aman", "Rina", "Suraj", "Lata", "Tushar", "Komal", "Niraj", "Aastha", "Milan", "Bina", "Abhishek", "Rekha", "Suman", "Chhaya", "Binod", "Alisha", "Bimal", "Jyoti", "Hemant", "Karishma", "Raju", "Aakriti", "Sagar", "Namrata", "Gaurav", "Smriti", "Dipesh", "Manju", "Rajesh", "Sandhya", "Roshan", "Kusum", "Bikash", "Tara", "Ashish", "Parbati", "Rabin", "Manisha", "Prakash", "Indira", "Anup", "Shreya", "Nabin", "Keshav", "Sarita", "Sudeep", "Dipa", "Sujan", "Rachana", "Ganesh", "Urmila", "Pritam", "Madhu", "Rajan", "Ishwori", "Naresh", "Bhawana", "Laxman", "Kalpana", "Mahesh", "Arati", "Shyam", "Sumitra", "Tej", "Malati", "Kishor", "Chandani", "Bijay", "Shila", "Ritesh", "Nirmala", "Santosh", "Hema", "Pawan", "Roshni"
]
classes = [6, 7, 8]
sections = ['A', 'B', 'C']
genders = ['Male', 'Female']

# Controlled variance marks generation function
def generate_marks():
    return random.randint(65, 98)

# Create DataFrame
data = []
for name in names:
    cls = random.choice(classes)
    sec = random.choice(sections)
    gender = random.choice(genders)
    math = generate_marks()
    science = generate_marks()
    english = generate_marks()
    history = generate_marks()
    total = math + science + english + history
    percentage = round(total / 4, 2)
    data.append([name, cls, sec, gender, math, science, english, history, total, percentage])

columns = [
    "Name", "Class", "Section", "Gender",
    "Math", "Science", "English", "History", "Total", "Percentage"
]
df = pd.DataFrame(data, columns=columns)
df.head(10)

,Name,Class,Section,Gender,Math,Science,English,History,Total,Percentage
0,Aarav,8,B,Female,81,78,66,76,301,75.25
1,Sita,8,C,Male,88,81,97,75,341,85.25
2,Rohan,8,B,Male,91,73,90,91,345,86.25
3,Nisha,6,B,Female,67,68,74,88,297,74.25
4,Karan,6,A,Female,79,70,74,79,302,75.50
5,Priya,6,B,Female,84,91,90,79,344,86.00
6,Rahul,6,B,Male,77,75,76,87,315,78.75
7,Anita,6,C,Male,66,76,78,76,296,74.00
8,Vikram,8,A,Male,98,75,91,95,359,89.75
9,Neha,8,A,Male,79,82,67,78,306,76.50

In [30]:
df

,Name,Class,Section,Gender,Math,Science,English,History,Total,Percentage
0,Aarav,8,B,Female,81,78,66,76,301,75.25
1,Sita,8,C,Male,88,81,97,75,341,85.25
2,Rohan,8,B,Male,91,73,90,91,345,86.25
3,Nisha,6,B,Female,67,68,74,88,297,74.25
4,Karan,6,A,Female,79,70,74,79,302,75.50
...,...,...,...,...,...,...,...,...,...,...
94,Nirmala,6,C,Male,78,70,94,80,322,80.50
95,Santosh,6,A,Female,75,72,86,79,312,78.00
96,Hema,6,A,Male,65,81,90,81,317,79.25
97,Pawan,6,C,Male,98,86,96,81,361,90.25
98,Roshni,6,B,Male,88,81,83,70,322,80.50

In [31]:
df.to_csv("Data.csv",index=False)

In [32]:
len(df)

99

In [33]:
df.columns

Index(['Name', 'Class', 'Section', 'Gender', 'Math', 'Science', 'English',
       'History', 'Total', 'Percentage'],
      dtype='object')

In [34]:
df.head(2)

,Name,Class,Section,Gender,Math,Science,English,History,Total,Percentage
0,Aarav,8,B,Female,81,78,66,76,301,75.25
1,Sita,8,C,Male,88,81,97,75,341,85.25

In [36]:
df.groupby('Class')['Name'].count().reset_index()

   Class  Name
0      6    42
1      7    26
2      8    31

In [ ]:
df.loc[df["Percentage"].idxmax(),"Name of the student"]

'Lata'

In [ ]:
df["Percentage"].max()

92.25

In [38]:
cc=df.groupby('Class')['Name'].count().reset_index()

In [44]:
cc["Class"]=cc["Class"].astype("str")
# replace({
#     7:"7",
#     8:"8",
#     6:"6"
# })

In [45]:
cc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Class   3 non-null      object
 1   Name    3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [46]:
cc

  Class  Name
0     6    42
1     7    26
2     8    31

In [47]:
df.head(2)

,Name,Class,Section,Gender,Math,Science,English,History,Total,Percentage
0,Aarav,8,B,Female,81,78,66,76,301,75.25
1,Sita,8,C,Male,88,81,97,75,341,85.25

In [56]:
pd.DataFrame(df[["Math","Science","English","History"]].mean()).reset_index()

     index          0
0     Math  80.727273
1  Science  81.555556
2  English  83.151515
3  History  81.454545

In [58]:
val=df[["Math","Science","English","History"]].mean()

In [61]:
pd.DataFrame(val)

                 0
Math     80.727273
Science  81.555556
English  83.151515
History  81.454545

In [77]:
df["Name"][1]

'Sita'

In [78]:
ndf=df[df["Name"]=="Sita"].reset_index()

In [79]:
ndf

,index,Name,Class,Section,Gender,Math,Science,English,History,Total,Percentage
0,1,Sita,8,C,Male,88,81,97,75,341,85.25

In [72]:
list(ndf.iloc[0])

['Aarav', 8, 'B', 'Female', 81, 78, 66, 76, 301, 75.25]

In [74]:
ndf.loc[0,"Name"]

'Aarav'

In [81]:
df[df["Name"]=="Aarav"].iloc[0]

Name           Aarav
Class              8
Section            B
Gender        Female
Math              81
Science           78
English           66
History           76
Total            301
Percentage     75.25
Name: 0, dtype: object

In [84]:
lst=[1,2,3,4,5]
l=lst[1:3]
l.append(lst[4])
print(l)

[2, 3, 5]

In [85]:
df.columns

Index(['Name', 'Class', 'Section', 'Gender', 'Math', 'Science', 'English',
       'History', 'Total', 'Percentage'],
      dtype='object')